app/controllers/api/v1/inventory_controller.rb

  def index
    inventory = Inventory.all
---
SELECT "inventories".* FROM "inventories"

  def update
    inventory = Inventory.find_by(ingredient_name: params[:ingredient_name])
    if inventory
      inventory.stock += params[:stock].to_i
      if inventory.save
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."ingredient_name" = ? LIMIT ?  [["ingredient_name", "Cheese"], ["LIMIT", 1]]
UPDATE "inventories" SET "stock" = ?, "updated_at" = ? WHERE "inventories"."id" = ?  [["stock", 130], ["updated_at", "2025-01-28 11:02:22.828523"], ["id", 8]]