app/controllers/api/v1/menu_controller.rb

  def index
    pizzas = Pizza.all
    crusts = Crust.all
    toppings = Topping.all
    sides = Side.all
---
SELECT "pizzas".* FROM "pizzas"
SELECT "crusts".* FROM "crusts"
SELECT "toppings".* FROM "toppings"
SELECT "sides".* FROM "sides"

  def create
    pizza = Pizza.new(menu_params)
    if pizza.save
---
INSERT INTO "pizzas" ("name", "size", "price", "is_vegetarian", "created_at", "updated_at", "crust_id") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "Deluxe Veggie"], ["size", "Regular"], ["price", 150], ["is_vegetarian", 1], ["created_at", "2025-01-28 10:46:40.397262"], ["updated_at", "2025-01-28 10:46:40.397262"], ["crust_id", 8]]