app/controllers/api/v1/orders_controller.rb

  def create
    order = Order.new(order_params.except(:pizzas, :sides))

    if order_params[:pizzas].blank?
      return render json: { error: "Pizzas can't be blank" }, status: :unprocessable_entity
    elsif order_params[:sides].blank?
      return render json: { error: "Sides can't be blank" }, status: :unprocessable_entity
    end

    order.pizzas = Pizza.where(id: order_params[:pizzas].map { |pizza| pizza[:id] })
    order.sides = Side.where(id: order_params[:sides])

    order.pizzas.each_with_index do |pizza, index|
      topping_ids = order_params[:pizzas][index][:topping_ids]
      if topping_ids.present?
        pizza.toppings = Topping.where(id: topping_ids)
      end
    end

    order.total_price = calculate_total(order)
    order.status = "confirmed"

    if order.save
---
SELECT "sides".* FROM "sides" WHERE "sides"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT "toppings".* FROM "toppings" INNER JOIN "pizza_toppings" ON "toppings"."id" = "pizza_toppings"."topping_id" WHERE "pizza_toppings"."pizza_id" = ?  [["pizza_id", 1]]
INSERT INTO "pizzas" ("id", "name", "size", "price", "is_vegetarian", "created_at", "updated_at", "crust_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["id", 1], ["name", nil], ["size", "Regular"], ["price", nil], ["is_vegetarian", nil], ["created_at", "2025-01-28 08:10:02.272944"], ["updated_at", "2025-01-28 08:10:02.272944"], ["crust_id", 1]]
INSERT INTO "order_pizzas" ("order_id", "pizza_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["order_id", 2], ["pizza_id", 1], ["created_at", "2025-01-28 10:24:26.504182"], ["updated_at", "2025-01-28 10:24:26.504182"]]
INSERT INTO "order_sides" ("order_id", "side_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["order_id", 2], ["side_id", 1], ["created_at", "2025-01-28 10:24:26.506345"], ["updated_at", "2025-01-28 10:24:26.506345"]]
INSERT INTO "orders" ("total_price", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["total_price", 41], ["status", "confirmed"], ["created_at", "2025-01-28 10:24:26.502607"], ["updated_at", "2025-01-28 10:24:26.502607"]]